Revit 2027 API
ParameterTypeId.MepAnalyticalNetwork Property
 "Network Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepAnalyticalNetwork { get; }
Public Shared ReadOnly Property MepAnalyticalNetwork As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepAnalyticalNetwork {
	ForgeTypeId^ get ();
}
static member MepAnalyticalNetwork : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace